2019-04-08 04:02:18.354869: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1432] Found device 0 with properties: 
name: GeForce RTX 2080 Ti major: 7 minor: 5 memoryClockRate(GHz): 1.635
pciBusID: 0000:01:00.0
totalMemory: 10.73GiB freeMemory: 10.53GiB
2019-04-08 04:02:18.354900: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1511] Adding visible gpu devices: 0
2019-04-08 04:02:18.646374: I tensorflow/core/common_runtime/gpu/gpu_device.cc:982] Device interconnect StreamExecutor with strength 1 edge matrix:
2019-04-08 04:02:18.646415: I tensorflow/core/common_runtime/gpu/gpu_device.cc:988]      0 
2019-04-08 04:02:18.646422: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1001] 0:   N 
2019-04-08 04:02:18.646666: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1115] Created TensorFlow device (/job:localhost/replica:0/task:0/device:GPU:0 with 10167 MB memory) -> physical GPU (device: 0, name: GeForce RTX 2080 Ti, pci bus id: 0000:01:00.0, compute capability: 7.5)
concat_axis= 3
Model created
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
initial_conv2D (Conv2D)         (None, 32, 32, 16)   432         input_1[0][0]                    
__________________________________________________________________________________________________
dense_0_0_bn (BatchNormalizatio (None, 32, 32, 16)   64          initial_conv2D[0][0]             
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           dense_0_0_bn[0][0]               
__________________________________________________________________________________________________
dense_0_0_conv2D (Conv2D)       (None, 32, 32, 12)   1728        activation_1[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 28)   0           initial_conv2D[0][0]             
                                                                 dense_0_0_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_1_bn (BatchNormalizatio (None, 32, 32, 28)   112         concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 28)   0           dense_0_1_bn[0][0]               
__________________________________________________________________________________________________
dense_0_1_conv2D (Conv2D)       (None, 32, 32, 12)   3024        activation_2[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 40)   0           concatenate_1[0][0]              
                                                                 dense_0_1_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_2_bn (BatchNormalizatio (None, 32, 32, 40)   160         concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 40)   0           dense_0_2_bn[0][0]               
__________________________________________________________________________________________________
dense_0_2_conv2D (Conv2D)       (None, 32, 32, 12)   4320        activation_3[0][0]               
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 32, 32, 52)   0           concatenate_2[0][0]              
                                                                 dense_0_2_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_3_bn (BatchNormalizatio (None, 32, 32, 52)   208         concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 52)   0           dense_0_3_bn[0][0]               
__________________________________________________________________________________________________
dense_0_3_conv2D (Conv2D)       (None, 32, 32, 12)   5616        activation_4[0][0]               
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 32, 32, 64)   0           concatenate_3[0][0]              
                                                                 dense_0_3_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_4_bn (BatchNormalizatio (None, 32, 32, 64)   256         concatenate_4[0][0]              
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 64)   0           dense_0_4_bn[0][0]               
__________________________________________________________________________________________________
dense_0_4_conv2D (Conv2D)       (None, 32, 32, 12)   6912        activation_5[0][0]               
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 32, 32, 76)   0           concatenate_4[0][0]              
                                                                 dense_0_4_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_5_bn (BatchNormalizatio (None, 32, 32, 76)   304         concatenate_5[0][0]              
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 76)   0           dense_0_5_bn[0][0]               
__________________________________________________________________________________________________
dense_0_5_conv2D (Conv2D)       (None, 32, 32, 12)   8208        activation_6[0][0]               
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 32, 32, 88)   0           concatenate_5[0][0]              
                                                                 dense_0_5_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_6_bn (BatchNormalizatio (None, 32, 32, 88)   352         concatenate_6[0][0]              
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 88)   0           dense_0_6_bn[0][0]               
__________________________________________________________________________________________________
dense_0_6_conv2D (Conv2D)       (None, 32, 32, 12)   9504        activation_7[0][0]               
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 32, 32, 100)  0           concatenate_6[0][0]              
                                                                 dense_0_6_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_7_bn (BatchNormalizatio (None, 32, 32, 100)  400         concatenate_7[0][0]              
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 100)  0           dense_0_7_bn[0][0]               
__________________________________________________________________________________________________
dense_0_7_conv2D (Conv2D)       (None, 32, 32, 12)   10800       activation_8[0][0]               
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 32, 32, 112)  0           concatenate_7[0][0]              
                                                                 dense_0_7_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_8_bn (BatchNormalizatio (None, 32, 32, 112)  448         concatenate_8[0][0]              
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 112)  0           dense_0_8_bn[0][0]               
__________________________________________________________________________________________________
dense_0_8_conv2D (Conv2D)       (None, 32, 32, 12)   12096       activation_9[0][0]               
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 32, 32, 124)  0           concatenate_8[0][0]              
                                                                 dense_0_8_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_9_bn (BatchNormalizatio (None, 32, 32, 124)  496         concatenate_9[0][0]              
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 32, 124)  0           dense_0_9_bn[0][0]               
__________________________________________________________________________________________________
dense_0_9_conv2D (Conv2D)       (None, 32, 32, 12)   13392       activation_10[0][0]              
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 32, 32, 136)  0           concatenate_9[0][0]              
                                                                 dense_0_9_conv2D[0][0]           
__________________________________________________________________________________________________
dense_0_10_bn (BatchNormalizati (None, 32, 32, 136)  544         concatenate_10[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 32, 32, 136)  0           dense_0_10_bn[0][0]              
__________________________________________________________________________________________________
dense_0_10_conv2D (Conv2D)      (None, 32, 32, 12)   14688       activation_11[0][0]              
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 32, 32, 148)  0           concatenate_10[0][0]             
                                                                 dense_0_10_conv2D[0][0]          
__________________________________________________________________________________________________
dense_0_11_bn (BatchNormalizati (None, 32, 32, 148)  592         concatenate_11[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 32, 32, 148)  0           dense_0_11_bn[0][0]              
__________________________________________________________________________________________________
dense_0_11_conv2D (Conv2D)      (None, 32, 32, 12)   15984       activation_12[0][0]              
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 32, 32, 160)  0           concatenate_11[0][0]             
                                                                 dense_0_11_conv2D[0][0]          
__________________________________________________________________________________________________
tr_0_bn (BatchNormalization)    (None, 32, 32, 160)  640         concatenate_12[0][0]             
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 32, 32, 160)  0           tr_0_bn[0][0]                    
__________________________________________________________________________________________________
tr_0_conv2D (Conv2D)            (None, 32, 32, 160)  25600       activation_13[0][0]              
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 16, 16, 160)  0           tr_0_conv2D[0][0]                
__________________________________________________________________________________________________
dense_1_0_bn (BatchNormalizatio (None, 16, 16, 160)  640         average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 16, 16, 160)  0           dense_1_0_bn[0][0]               
__________________________________________________________________________________________________
dense_1_0_conv2D (Conv2D)       (None, 16, 16, 12)   17280       activation_14[0][0]              
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 16, 16, 172)  0           average_pooling2d_1[0][0]        
                                                                 dense_1_0_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_1_bn (BatchNormalizatio (None, 16, 16, 172)  688         concatenate_13[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 16, 16, 172)  0           dense_1_1_bn[0][0]               
__________________________________________________________________________________________________
dense_1_1_conv2D (Conv2D)       (None, 16, 16, 12)   18576       activation_15[0][0]              
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 16, 16, 184)  0           concatenate_13[0][0]             
                                                                 dense_1_1_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_2_bn (BatchNormalizatio (None, 16, 16, 184)  736         concatenate_14[0][0]             
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 16, 16, 184)  0           dense_1_2_bn[0][0]               
__________________________________________________________________________________________________
dense_1_2_conv2D (Conv2D)       (None, 16, 16, 12)   19872       activation_16[0][0]              
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 16, 16, 196)  0           concatenate_14[0][0]             
                                                                 dense_1_2_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_3_bn (BatchNormalizatio (None, 16, 16, 196)  784         concatenate_15[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 16, 16, 196)  0           dense_1_3_bn[0][0]               
__________________________________________________________________________________________________
dense_1_3_conv2D (Conv2D)       (None, 16, 16, 12)   21168       activation_17[0][0]              
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 16, 16, 208)  0           concatenate_15[0][0]             
                                                                 dense_1_3_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_4_bn (BatchNormalizatio (None, 16, 16, 208)  832         concatenate_16[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 16, 16, 208)  0           dense_1_4_bn[0][0]               
__________________________________________________________________________________________________
dense_1_4_conv2D (Conv2D)       (None, 16, 16, 12)   22464       activation_18[0][0]              
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 16, 16, 220)  0           concatenate_16[0][0]             
                                                                 dense_1_4_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_5_bn (BatchNormalizatio (None, 16, 16, 220)  880         concatenate_17[0][0]             
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 16, 16, 220)  0           dense_1_5_bn[0][0]               
__________________________________________________________________________________________________
dense_1_5_conv2D (Conv2D)       (None, 16, 16, 12)   23760       activation_19[0][0]              
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 16, 16, 232)  0           concatenate_17[0][0]             
                                                                 dense_1_5_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_6_bn (BatchNormalizatio (None, 16, 16, 232)  928         concatenate_18[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 16, 16, 232)  0           dense_1_6_bn[0][0]               
__________________________________________________________________________________________________
dense_1_6_conv2D (Conv2D)       (None, 16, 16, 12)   25056       activation_20[0][0]              
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, 16, 16, 244)  0           concatenate_18[0][0]             
                                                                 dense_1_6_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_7_bn (BatchNormalizatio (None, 16, 16, 244)  976         concatenate_19[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 16, 16, 244)  0           dense_1_7_bn[0][0]               
__________________________________________________________________________________________________
dense_1_7_conv2D (Conv2D)       (None, 16, 16, 12)   26352       activation_21[0][0]              
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 16, 16, 256)  0           concatenate_19[0][0]             
                                                                 dense_1_7_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_8_bn (BatchNormalizatio (None, 16, 16, 256)  1024        concatenate_20[0][0]             
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 16, 16, 256)  0           dense_1_8_bn[0][0]               
__________________________________________________________________________________________________
dense_1_8_conv2D (Conv2D)       (None, 16, 16, 12)   27648       activation_22[0][0]              
__________________________________________________________________________________________________
concatenate_21 (Concatenate)    (None, 16, 16, 268)  0           concatenate_20[0][0]             
                                                                 dense_1_8_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_9_bn (BatchNormalizatio (None, 16, 16, 268)  1072        concatenate_21[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 16, 16, 268)  0           dense_1_9_bn[0][0]               
__________________________________________________________________________________________________
dense_1_9_conv2D (Conv2D)       (None, 16, 16, 12)   28944       activation_23[0][0]              
__________________________________________________________________________________________________
concatenate_22 (Concatenate)    (None, 16, 16, 280)  0           concatenate_21[0][0]             
                                                                 dense_1_9_conv2D[0][0]           
__________________________________________________________________________________________________
dense_1_10_bn (BatchNormalizati (None, 16, 16, 280)  1120        concatenate_22[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 16, 16, 280)  0           dense_1_10_bn[0][0]              
__________________________________________________________________________________________________
dense_1_10_conv2D (Conv2D)      (None, 16, 16, 12)   30240       activation_24[0][0]              
__________________________________________________________________________________________________
concatenate_23 (Concatenate)    (None, 16, 16, 292)  0           concatenate_22[0][0]             
                                                                 dense_1_10_conv2D[0][0]          
__________________________________________________________________________________________________
dense_1_11_bn (BatchNormalizati (None, 16, 16, 292)  1168        concatenate_23[0][0]             
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 16, 16, 292)  0           dense_1_11_bn[0][0]              
__________________________________________________________________________________________________
dense_1_11_conv2D (Conv2D)      (None, 16, 16, 12)   31536       activation_25[0][0]              
__________________________________________________________________________________________________
concatenate_24 (Concatenate)    (None, 16, 16, 304)  0           concatenate_23[0][0]             
                                                                 dense_1_11_conv2D[0][0]          
__________________________________________________________________________________________________
tr_1_bn (BatchNormalization)    (None, 16, 16, 304)  1216        concatenate_24[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 16, 16, 304)  0           tr_1_bn[0][0]                    
__________________________________________________________________________________________________
tr_1_conv2D (Conv2D)            (None, 16, 16, 304)  92416       activation_26[0][0]              
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 8, 8, 304)    0           tr_1_conv2D[0][0]                
__________________________________________________________________________________________________
dense_2_0_bn (BatchNormalizatio (None, 8, 8, 304)    1216        average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 8, 8, 304)    0           dense_2_0_bn[0][0]               
__________________________________________________________________________________________________
dense_2_0_conv2D (Conv2D)       (None, 8, 8, 12)     32832       activation_27[0][0]              
__________________________________________________________________________________________________
concatenate_25 (Concatenate)    (None, 8, 8, 316)    0           average_pooling2d_2[0][0]        
                                                                 dense_2_0_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_1_bn (BatchNormalizatio (None, 8, 8, 316)    1264        concatenate_25[0][0]             
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 8, 8, 316)    0           dense_2_1_bn[0][0]               
__________________________________________________________________________________________________
dense_2_1_conv2D (Conv2D)       (None, 8, 8, 12)     34128       activation_28[0][0]              
__________________________________________________________________________________________________
concatenate_26 (Concatenate)    (None, 8, 8, 328)    0           concatenate_25[0][0]             
                                                                 dense_2_1_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_2_bn (BatchNormalizatio (None, 8, 8, 328)    1312        concatenate_26[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 8, 8, 328)    0           dense_2_2_bn[0][0]               
__________________________________________________________________________________________________
dense_2_2_conv2D (Conv2D)       (None, 8, 8, 12)     35424       activation_29[0][0]              
__________________________________________________________________________________________________
concatenate_27 (Concatenate)    (None, 8, 8, 340)    0           concatenate_26[0][0]             
                                                                 dense_2_2_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_3_bn (BatchNormalizatio (None, 8, 8, 340)    1360        concatenate_27[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 8, 8, 340)    0           dense_2_3_bn[0][0]               
__________________________________________________________________________________________________
dense_2_3_conv2D (Conv2D)       (None, 8, 8, 12)     36720       activation_30[0][0]              
__________________________________________________________________________________________________
concatenate_28 (Concatenate)    (None, 8, 8, 352)    0           concatenate_27[0][0]             
                                                                 dense_2_3_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_4_bn (BatchNormalizatio (None, 8, 8, 352)    1408        concatenate_28[0][0]             
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 8, 8, 352)    0           dense_2_4_bn[0][0]               
__________________________________________________________________________________________________
dense_2_4_conv2D (Conv2D)       (None, 8, 8, 12)     38016       activation_31[0][0]              
__________________________________________________________________________________________________
concatenate_29 (Concatenate)    (None, 8, 8, 364)    0           concatenate_28[0][0]             
                                                                 dense_2_4_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_5_bn (BatchNormalizatio (None, 8, 8, 364)    1456        concatenate_29[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 8, 8, 364)    0           dense_2_5_bn[0][0]               
__________________________________________________________________________________________________
dense_2_5_conv2D (Conv2D)       (None, 8, 8, 12)     39312       activation_32[0][0]              
__________________________________________________________________________________________________
concatenate_30 (Concatenate)    (None, 8, 8, 376)    0           concatenate_29[0][0]             
                                                                 dense_2_5_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_6_bn (BatchNormalizatio (None, 8, 8, 376)    1504        concatenate_30[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 8, 8, 376)    0           dense_2_6_bn[0][0]               
__________________________________________________________________________________________________
dense_2_6_conv2D (Conv2D)       (None, 8, 8, 12)     40608       activation_33[0][0]              
__________________________________________________________________________________________________
concatenate_31 (Concatenate)    (None, 8, 8, 388)    0           concatenate_30[0][0]             
                                                                 dense_2_6_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_7_bn (BatchNormalizatio (None, 8, 8, 388)    1552        concatenate_31[0][0]             
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 8, 8, 388)    0           dense_2_7_bn[0][0]               
__________________________________________________________________________________________________
dense_2_7_conv2D (Conv2D)       (None, 8, 8, 12)     41904       activation_34[0][0]              
__________________________________________________________________________________________________
concatenate_32 (Concatenate)    (None, 8, 8, 400)    0           concatenate_31[0][0]             
                                                                 dense_2_7_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_8_bn (BatchNormalizatio (None, 8, 8, 400)    1600        concatenate_32[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 8, 8, 400)    0           dense_2_8_bn[0][0]               
__________________________________________________________________________________________________
dense_2_8_conv2D (Conv2D)       (None, 8, 8, 12)     43200       activation_35[0][0]              
__________________________________________________________________________________________________
concatenate_33 (Concatenate)    (None, 8, 8, 412)    0           concatenate_32[0][0]             
                                                                 dense_2_8_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_9_bn (BatchNormalizatio (None, 8, 8, 412)    1648        concatenate_33[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 8, 8, 412)    0           dense_2_9_bn[0][0]               
__________________________________________________________________________________________________
dense_2_9_conv2D (Conv2D)       (None, 8, 8, 12)     44496       activation_36[0][0]              
__________________________________________________________________________________________________
concatenate_34 (Concatenate)    (None, 8, 8, 424)    0           concatenate_33[0][0]             
                                                                 dense_2_9_conv2D[0][0]           
__________________________________________________________________________________________________
dense_2_10_bn (BatchNormalizati (None, 8, 8, 424)    1696        concatenate_34[0][0]             
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 8, 8, 424)    0           dense_2_10_bn[0][0]              
__________________________________________________________________________________________________
dense_2_10_conv2D (Conv2D)      (None, 8, 8, 12)     45792       activation_37[0][0]              
__________________________________________________________________________________________________
concatenate_35 (Concatenate)    (None, 8, 8, 436)    0           concatenate_34[0][0]             
                                                                 dense_2_10_conv2D[0][0]          
__________________________________________________________________________________________________
dense_2_11_bn (BatchNormalizati (None, 8, 8, 436)    1744        concatenate_35[0][0]             
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 8, 8, 436)    0           dense_2_11_bn[0][0]              
__________________________________________________________________________________________________
dense_2_11_conv2D (Conv2D)      (None, 8, 8, 12)     47088       activation_38[0][0]              
__________________________________________________________________________________________________
concatenate_36 (Concatenate)    (None, 8, 8, 448)    0           concatenate_35[0][0]             
                                                                 dense_2_11_conv2D[0][0]          
__________________________________________________________________________________________________
final_bn (BatchNormalization)   (None, 8, 8, 448)    1792        concatenate_36[0][0]             
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 8, 8, 448)    0           final_bn[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 448)          0           activation_39[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           4490        global_average_pooling2d_1[0][0] 
==================================================================================================
Total params: 1,037,818
Trainable params: 1,019,722
Non-trainable params: 18,096
__________________________________________________________________________________________________
Finished compiling
Epoch 1/100
 - 66s - loss: 1.4466 - acc: 0.5057 - val_loss: 1.7129 - val_acc: 0.4882
Epoch 2/100
 - 57s - loss: 1.0673 - acc: 0.6475 - val_loss: 1.5010 - val_acc: 0.5631
Epoch 3/100
 - 57s - loss: 0.9026 - acc: 0.7090 - val_loss: 1.1088 - val_acc: 0.6464
Epoch 4/100
 - 57s - loss: 0.7793 - acc: 0.7499 - val_loss: 0.8870 - val_acc: 0.7166
Epoch 5/100
 - 57s - loss: 0.6984 - acc: 0.7792 - val_loss: 0.8971 - val_acc: 0.7330
Epoch 6/100
 - 57s - loss: 0.6364 - acc: 0.8000 - val_loss: 0.8730 - val_acc: 0.7383
Epoch 7/100
 - 57s - loss: 0.5867 - acc: 0.8172 - val_loss: 0.7844 - val_acc: 0.7638
Epoch 8/100
 - 57s - loss: 0.5413 - acc: 0.8317 - val_loss: 0.7239 - val_acc: 0.7768
Epoch 9/100
 - 57s - loss: 0.5139 - acc: 0.8419 - val_loss: 0.7290 - val_acc: 0.7729
Epoch 10/100
 - 57s - loss: 0.4795 - acc: 0.8524 - val_loss: 0.6848 - val_acc: 0.7940
Epoch 11/100
 - 57s - loss: 0.4595 - acc: 0.8582 - val_loss: 0.6079 - val_acc: 0.8119
Epoch 12/100
 - 57s - loss: 0.4366 - acc: 0.8675 - val_loss: 0.5763 - val_acc: 0.8283
